"""4. Даний список:

list_of_six = [100, 106, 112, 118, 124, 130, 136, 142, 148, 154, 160, 166, 172, 178, 184, 190, 196]


Надрукувати всі числа, які діляться на 5 без залишку, але не більше 150."""

# list_of_six = range(100, 197, 6)
#
# for elem in [*list_of_six]:
#     if (elem % 5 == 0) and elem <= 150:
#         print(f'Число, яке ділитися на 5 без залишку, але не більше 150: {elem}')

list_of_six = [print(f'X % 5 == 0 and x <= 150: {elem}') for elem in [*range(100, 197, 6)] if (elem % 5 == 0) and elem <= 150]