# 3. Ввести у консолі (або модулі і запустити його)
# import this
# Приведенный вами текст - это "The Zen of Python"
# (Философия Python) Тима Петерса. Это набор принципов,
# которыми руководствуются при написании программ на языке
# программирования Python. Эти принципы подчеркивают важность
# читаемости кода, простоты и практичности. Вот разбор каждого
# принципа, упомянутого в тексте:

# import antigravity
# Комикс, на который перенаправляет модуль antigravity,
# является шуточным и носит название "Antigravity".
# Этот комикс создан Рэндаллом Манро (Randall Munroe),
# автором известного веб-комикса "xkcd". "xkcd" - это популярная серия комиксов,
# которая известна своим юмором, игрой слов и связанными с наукой и технологией темами.

# import __hello__
# Код import __hello__ является ещё одним пасхальным яйцом в Python.
# При выполнении этого кода будет выведено сообщение "Hello world!" ("Привет, мир!").

# from __future__ import braces
# joke, в Python ушли от использование braces - SyntaxError.


# 4. Вивести на консоль своє ім'я, намальоване 'зірочками'
# print("   *****    *****   *****    *****    *****  ");
# print("  *        *       *     *  *        *     * ");
# print("  *        *       *     *  *        *     * ");
# print("   *****   * ****  * ****   *  ***   *     * ");
# print("        *  *       * *      *     *  *     * ");
# print("        *  *       *  *     *     *  *     * ");
# print("   *****    *****  *    *    *****    *****  ");

# * Дод. Виведення арт-ascii тексту модулем art (pip install art). Прочитати можна в репозиторії PyPi – search – art.
# from art import *
# tprint("SERGO", font="block")

# 5. Написати програму, яка виводить у консоль таблицю Escape-послідовностей:

# print('flex \a flex\b\b\b +3 l = flex \nnew line flex \nhorizontal tab \\\nquotes  \"FLEX"');
# print("quotes2 \'FLEX'");

# 6. Ввести з клавіатури два цілих числа: x та y
#   - Вивести на екран консолі обидва числа, використовуючи тільки один виклик print()
#   - Обчислити суму чисел
#   - Виконати цілий поділ
#   - Знайти решту
#   - Обчислити ступінь числа: x^y

# number = int(input('Введіть ціле число 1: '))
# number2 = int(input('Введіть ціле число 2: '))

# print('Введені числа:', number, number2)
# print('Сума чисел - ', number + number2)
# print('Цілий поділ - ', number // number2)
# print('Решта - ', number % number2)
# print('Ступінь ', number, '^', number2, ' - ', number ** number2)


